#Использовать asserts
#Использовать "../src"

Перем юТест; 	// Движок тестов
Перем Лог;		// Текущий лог
Перем МенеджерВременныхФайлов;	// Для управления временными файлами

// Основная точка входа
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	  
	ВсеТесты.Добавить("Тест_ПроверитьВерсию");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура Тест_ПроверитьВерсию() Экспорт

// тест нужен чтобы лишний раз обратить внимание на изменение версии, и, возможно, стоит что-то доделать
Ожидаем.Что(ПараметрыПриложения.Версия()).Равно("23.02");

КонецПроцедуры
