#Использовать asserts
#Использовать logos
#Использовать tempfiles
#Использовать "../src"

Перем юТест; 	// Движок тестов
Перем Лог;		// Текущий лог
Перем МенеджерВременныхФайлов;	// Для управления временными файлами

// Основная точка входа
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ПередЗапускомТестов();
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	  
	ВсеТесты.Добавить("Тест_НормализацияИмени");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ПередЗапускомТестов()
	
	Попытка
		ВремТестер = Новый Тестер;
		Лог = Логирование.ПолучитьЛог(ВремТестер.ИмяЛога());
	Исключение
		Лог = Логирование.ПолучитьЛог("Test");
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
	ПараметрыПриложения.УстановитьРежимОтладки(Истина);
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура Тест_НормализацияИмени() Экспорт
	
	ОченьБольшоеИмя = "Это большое имя и оно не содержит точек вот вообще в котором сообщается " 
	+ "что нельзя кушать булки много Много булок не сделают вас счастливым в далекой перспективе  " 
	+ " Вы помешаете своему организму правильно усваивать основной. прием пищи. Обманул, есть тут точки. ";
	БольшоеИмя = "Это большое имя в котором сообщается что нельзя кушать булки много. " 
	+ "Много булок не сделают вас счастливым в далекой перспективе. " 
	+ "Вы помешаете своему организму правильно усваивать основной прием пищи.";
	ИмяПоменьше = "Это имя поменьше в котором сообщается что нельзя кушать булки много.";
	СовсемМаленькоеИмя = "Кусь булку";

	ХранилищеПравил = Новый ХранилищеПравил;

	ОченьБольшоеИмяНормализованное = ХранилищеПравил.НормализоватьИмяПравила(ОченьБольшоеИмя);
	БольшоеИмяНормализованное = ХранилищеПравил.НормализоватьИмяПравила(БольшоеИмя);
	ИмяПоменьшеНормализованное = ХранилищеПравил.НормализоватьИмяПравила(ИмяПоменьше);
	СовсемМаленькоеИмяНормализованное = ХранилищеПравил.НормализоватьИмяПравила(СовсемМаленькоеИмя);

	Ожидаем.Что(ОченьБольшоеИмя).ЭтоНе().Равно(ОченьБольшоеИмяНормализованное).Больше(ОченьБольшоеИмяНормализованное);

	Ожидаем.Что(БольшоеИмя).ЭтоНе().Равно(БольшоеИмяНормализованное).Больше(БольшоеИмяНормализованное);
	Ожидаем.Что(БольшоеИмяНормализованное).Равно("Это большое имя в котором сообщается что нельзя кушать булки много.");

	Ожидаем.Что(ИмяПоменьше).Равно(ИмяПоменьше);

	Ожидаем.Что(СовсемМаленькоеИмя).Равно(СовсемМаленькоеИмя);

КонецПроцедуры
